; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph5 - mode
	thermograph0 - mode
	spectrograph4 - mode
	infrared6 - mode
	thermograph2 - mode
	thermograph3 - mode
	image1 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star2 - direction
	GroundStation0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared6)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star5)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(have_image Star6 thermograph0)
	(have_image Star6 spectrograph4)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon7 infrared6)
	(have_image Star8 thermograph3)
	(have_image Star8 infrared6)
	(have_image Phenomenon9 spectrograph4)
	(have_image Phenomenon9 thermograph3)
	(have_image Star10 spectrograph4)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon11 thermograph3)
	(have_image Planet12 infrared6)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 infrared6)
	(have_image Star14 thermograph5)
))

)

; plan
1. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 15
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 15
3. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 15
4. (turn_to satellite1 star6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star6)
   goals met: 0 of 15
5. (take_image satellite1 star6 instrument3 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 1 of 15
6. (take_image satellite1 star6 instrument3 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 2 of 15
7. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 15
8. (take_image satellite1 phenomenon9 instrument3 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 3 of 15
9. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 15
10. (turn_to satellite0 groundstation1 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 15
11. (take_image satellite1 phenomenon7 instrument3 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 4 of 15
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 15
13. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 15
14. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 15
15. (take_image satellite0 phenomenon13 instrument0 infrared6)
   added: (have_image phenomenon13 infrared6)
   goals met: 5 of 15
16. (turn_to satellite0 phenomenon7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 15
17. (take_image satellite0 phenomenon7 instrument0 infrared6)
   added: (have_image phenomenon7 infrared6)
   goals met: 6 of 15
18. (turn_to satellite0 planet12 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet12)
   goals met: 6 of 15
19. (take_image satellite0 planet12 instrument0 infrared6)
   added: (have_image planet12 infrared6)
   goals met: 7 of 15
20. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 7 of 15
21. (take_image satellite0 star8 instrument0 infrared6)
   added: (have_image star8 infrared6)
   goals met: 8 of 15
22. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 15
23. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 8 of 15
24. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 8 of 15
25. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 8 of 15
26. (turn_to satellite0 phenomenon11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon11)
   goals met: 8 of 15
27. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 9 of 15
28. (take_image satellite0 phenomenon11 instrument1 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 10 of 15
29. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 15
30. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 11 of 15
31. (turn_to satellite0 star14 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star14)
   goals met: 11 of 15
32. (take_image satellite0 star14 instrument1 thermograph5)
   added: (have_image star14 thermograph5)
   goals met: 12 of 15
33. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 12 of 15
34. (take_image satellite0 star8 instrument1 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 13 of 15
35. (turn_to satellite1 planet12 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet12)
   goals met: 13 of 15
36. (take_image satellite1 planet12 instrument3 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 14 of 15
37. (turn_to satellite1 star10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star10)
   goals met: 14 of 15
38. (take_image satellite1 star10 instrument3 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 15 of 15
